Heatsink study of a FPV Drone/gemFan_Cases/inlet/o1/inlet_u0/0.orig/heatSink/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    heatSink_to_air
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        qrNbr           none;
        qr              none;
        Tnbr            T;
        kappaMethod     solidThermo;
        useImplicit     true;
        value           $internalField;
    }
    
    bottomHeatSink
    {
        type            externalWallHeatFluxTemperature;
        kappaMethod     solidThermo;
        mode            flux;
        Ta              $internalField;
        q               uniform 0;
        value           $internalField;
        kappaName       none;
    }   
}

// ************************************************************************* //
