Heatsink study of a FPV Drone/gemFan_Cases/inlet/o1/inlet_u0/constant/air/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       polynomial;
    thermo          hPolynomial;
    equationOfState icoPolynomial;//perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       28.966;
    }
    
    thermodynamics
    {
        CpCoeffs<8>     (1006.43 0 0 0 0 0 0 0);
        Hf              0;
        Sf              0;
    }

    transport
    {
        muCoeffs<8>              (1.201E-4 6.7381E-8 -3.199E-11 0 0 0 0 0);
        kappaCoeffs<8>           (6.746E-4 9.7123E-5 -3.803E-08 0 0 0 0 0);
    }

    equationOfState
    {
        rhoCoeffs<8>             (1.225 0 0 0 0 0 0 0);
    }
}

// ************************************************************************* //
