Heatsink study of a FPV Drone/gemFan_Cases/inlet/o1/inlet_u0/system/heatSink/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

heatSink_AbsoluteEnergySource
{
    type            scalarSemiImplicitSource;
    active          true;

    selectionMode   cellZone;
    cellZone        heatSink;
    volumeMode      absolute;

    sources
    {
        h           ( 0.6 0 );
    }
}


// ************************************************************************* //
